In [1]:
%load_ext sql

In [2]:
%sql sqlite://

'Connected: @None'

In [3]:
%%sql 
CREATE TABLE STUDENTS(StudentID integer, StudentName varchar(50),
                       ProgramName varchar(50), Address varchar(50),
                       City varchar(50), PostalCode varchar(10), 
                       Country varchar(50));

INSERT INTO STUDENTS VALUES(1, 'Alfreds Futterkiste','Computer Science',
                             'Obere Str. 57','Berlin',12209,'Germany');
INSERT INTO STUDENTS VALUES(2,'Ana Trujillo Emparedados y helados','Physics',
                             'Avda. de la Constitución 2222','México D.F.',05021,'Mexico');
INSERT INTO STUDENTS VALUES(3,'Antonio Moreno Taquería','Information Security',
                             'Mataderos 2312','México D.F.',05023,'Mexico');
INSERT INTO STUDENTS VALUES(4,'Around the Horn','Mathematics','120 Hanover Sq.',
                             'London','W A1 1DP','UK');
INSERT INTO STUDENTS VALUES(5,'Berglunds snabbköp','Neuroscience','Berguvsvägen 8',
                             'Luleå','S-958 22','Sweden');

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [5]:
%sql SELECT * from STUDENTS;

 * sqlite://
Done.

[(1, 'Alfreds Futterkiste', 'Computer Science', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Physics', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Information Security', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico'),
 (4, 'Around the Horn', 'Mathematics', '120 Hanover Sq.', 'London', 'W A1 1DP', 'UK'),
 (5, 'Berglunds snabbköp', 'Neuroscience', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')]

In [6]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

### SQL OrderBy Operator

~~~sql
SELECT column1, column2, ...
FROM table_name
ORDER BY column1, column2, ... ASC|DESC;
~~~

~~~sql
SELECT * FROM Customers
ORDER BY Country;


SELECT * FROM Customers
ORDER BY Country ASC, CustomerName DESC;


SELECT column_names
FROM table_name
WHERE column_name IS NULL;
~~~

#### SQL Wildcard Characters
A wildcard character is used to substitute any other character(s) in a string.
Wildcard characters are used with the SQL LIKE operator. The LIKE operator is used in a WHERE clause to search for a specified pattern in a column. 
There are two wildcards used in conjunction with the LIKE operator:
% - The percent sign represents zero, one, or multiple characters
_ - The underscore represents a single character
Note: MS Access uses a question mark (?) instead of the underscore (_).
In MS Access and SQL Server you can also use:
[charlist] - Defines sets and ranges of characters to match
[^charlist] or [!charlist] - Defines sets and ranges of characters NOT to match
The wildcards can also be used in combinations!
Here are some examples showing different LIKE operators with '%' and '_' wildcards:

|LIKE Operator|Description|
|--------------|----------|
|WHERE CustomerName LIKE 'a%'|Finds any values that start with "a"|
|WHERE CustomerName LIKE '%a'|Finds any values that end with "a"|
|WHERE CustomerName LIKE '%or%'|Finds any values that have "or" in any position|
|WHERE CustomerName LIKE '_r%'|Finds any values that have "r" in the second position|
|WHERE CustomerName LIKE 'a_%_%'|Finds any values that start with "a" and are at least 3 characters in length|
|WHERE ContactName LIKE 'a%o'|Finds any values that start with "a" and ends with "o"|